create_clock -period 10.000 -name clk -waveform {0.000 5.000} [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports g_m]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports g_m]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports rst]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports rst]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports start]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports start]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports done]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.500 [get_ports done]

#set_property IOSTANDARD LVCMOS33 [get_ports done]
#set_property IOSTANDARD LVCMOS33 [get_ports clk]
#set_property IOSTANDARD LVCMOS33 [get_ports ena]
#set_property IOSTANDARD LVCMOS33 [get_ports rst]
#set_property IOSTANDARD LVCMOS33 [get_ports start]
#set_property PACKAGE_PIN P3 [get_ports done]
#set_property PACKAGE_PIN R2 [get_ports ena]
#set_property PACKAGE_PIN T17 [get_ports rst]
#set_property PACKAGE_PIN T1 [get_ports start]
#set_property PACKAGE_PIN W5 [get_ports clk]